In [1]:
data= {'Customer_name': ['Carol White', 'Bob Brown', 'Eva Giri', 'Nancy Sanchez', 'Elliot Swift', 'Stephen Sanchez', 'Mike Brown', 'Julia Roberts', 'Kate Winston', 'Myra Jolie'],
       'Product': ['Smartphone', 'laptop', 'TV', 'Dish washer', 'Smartphone', 'laptop', 'TV', 'Laptop', None, 'Laptop'],
       'Price': [4000, 50000, 10000, None, 50000, 25000, 80000, None, 16000, 58000]}

In [2]:
import pandas as pd

In [3]:
df= pd.DataFrame(data)
df

     Customer_name      Product    Price
0      Carol White   Smartphone   4000.0
1        Bob Brown       laptop  50000.0
2         Eva Giri           TV  10000.0
3    Nancy Sanchez  Dish washer      NaN
4     Elliot Swift   Smartphone  50000.0
5  Stephen Sanchez       laptop  25000.0
6       Mike Brown           TV  80000.0
7    Julia Roberts       Laptop      NaN
8     Kate Winston         None  16000.0
9       Myra Jolie       Laptop  58000.0

In [4]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Customer_name  10 non-null     object
 1   Product        9 non-null      object
 2   Price          8 non-null      float64
dtypes: float64(1), object(2)
memory usage: 372.0+ bytes
None

In [31]:
df['Price'].mean()

36625.0

In [35]:
df['Product'].mode()

0        Laptop
1    Smartphone
2            TV
3        laptop
Name: Product, dtype: object

In [39]:
#Replacing the null values in each numerical columns with their mean
df['Price'] = df['Price'].fillna(value= df['Price'].mean())
print(df)

     Customer_name      Product    Price
0      Carol White   Smartphone   4000.0
1        Bob Brown       laptop  50000.0
2         Eva Giri           TV  10000.0
3    Nancy Sanchez  Dish washer  36625.0
4     Elliot Swift   Smartphone  50000.0
5  Stephen Sanchez       laptop  25000.0
6       Mike Brown           TV  80000.0
7    Julia Roberts       Laptop  36625.0
8     Kate Winston         None  16000.0
9       Myra Jolie       Laptop  58000.0

In [63]:
#Replacing the null values in each categorical columns with their mode
mode_value = df['Product'].mode()[0]  # Get the mode of column 'product'
df['Product'].fillna(mode_value, inplace=True)  # Replace NaN with the mode
print(df)

     Customer_name      Product    Price
0      Carol White   Smartphone   4000.0
1        Bob Brown       laptop  50000.0
2         Eva Giri           TV  10000.0
3    Nancy Sanchez  Dish washer  36625.0
4     Elliot Swift   Smartphone  50000.0
5  Stephen Sanchez       laptop  25000.0
6       Mike Brown           TV  80000.0
7    Julia Roberts       Laptop  36625.0
8     Kate Winston       Laptop  16000.0
9       Myra Jolie       Laptop  58000.0

In [65]:
df.isnull().sum()

Customer_name    0
Product          0
Price            0
dtype: int64

All the NUll VALUES in the categorical columns were replaced by its Mode value and those in Numerical Columns were replaced by their Mean value.